namespace KazApi.Common._Const
{
    /// <summary>
    /// モンスタータイプ定数
    /// </summary>
    public enum CMonsterType
    {
        キラービー = 1,
        カーミラ,
        デーモン,
        ゴブリン,
        マシンゴーレム,
        ハーピー,
        アーマーナイト,
        マジシャン,
        マイコニド,
        ニードルバード,
        プチドラゴン,
        ポト,
        プリースト,
        ラビ,
        グリーンスライム,
        イビルソード,
        ウルフ,
        ダック,
        モールベア,
        ギャルビー,
        サハギン,
        クロウラー,
        パックン,
        チビデビル,
        オーガボックス,
        バレッテ,
        バシリスク,
        スペクター,
        ユニコーンヘッド,
        シェイプシフター,
        ボルダー,
        パンプキンボム
    }
}
